import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: "Сулакский каньон",
    lat: 43.0034,
    lon: 46.4940,
    url: "https://youtravel.me/upload/medialibrary/2dc/2dcee12867047609489a83fc10e23074.jpg",
    details: "Местные говорят, что Сулакский каньон гораздо интереснее, чем Большой каньон в США. По крайней мере, он точно масштабнее: самая живописная достопримечательность Дагестана достигает 2 000 метров в глубину, 53 км в длину и 3 км в ширину.",
    type: "религия",
  ),
  Sight(
    name: "Бархан Сарыкум",
    lat: 43.0033,
    lon: 47.1351,
    url: "https://youtravel.me/upload/medialibrary/ee1/ee1ada8475e89b820640049319c6ef22.jpg",
    details: "В Дагестане находится редкий памятник природы – один на всю Евразию – гигантская песчаная гора площадью 600 гектаров и высотой 262 метра. Сарыкум называют филиалом пустыни Сахары в предгорье, и, по подсчетам ученых, его возраст составляет 5 000 лет.",
    type: "музей",
  ),
  Sight(
    name: "Водопад Тобот",
    lat: 42.3319,
    lon: 46.4308,
    url: "https://youtravel.me/upload/medialibrary/08b/08b93b6a848c8885bdfd112d13eb6664.jpg",
    details: "Один из самых высоких водопадов России вы найдете в горном Дагестане. Тобот получил свое имя от одноименной реки, но местные иногда называют его Хунзахским – в честь плато, с обрыва которого и стекает источник с высотой падения более 70 метров.",
    type: "развлечения",
  ),
];